In [1]:
import pandas as pd

In [5]:
df8=pd.DataFrame({"id":[1,2,3,4,5,6,7,8,9,10],"name":["zeeshan","amit","rohit","akhil","ramya","salman","sai kumar","pooja","manish","soni"],
                  "location":["hyderabad","delhi","chennai","bangalore","delhi","hyderabad","jamshedpur","chennai","bangalore","odisha"],
                              "age":[20,25,21,22,25,20,26,27,23,20]})
df8.head()

   id     name   location  age
0   1  zeeshan  hyderabad   20
1   2     amit      delhi   25
2   3    rohit    chennai   21
3   4    akhil  bangalore   22
4   5    ramya      delhi   25

In [4]:
df8

   id       name    location  age
0   1    zeeshan   hyderabad   20
1   2       amit       delhi   25
2   3      rohit     chennai   21
3   4      akhil   bangalore   22
4   5      ramya       delhi   25
5   6     salman   hyderabad   20
6   7  sai kumar  jamshedpur   26
7   8      pooja     chennai   27
8   9     manish   bangalore   23
9  10       soni      odisha   20

In [6]:
df8.groupby(["location"]).groups             # grouping the datas of a particular name

{'bangalore': [3, 8], 'chennai': [2, 7], 'delhi': [1, 4], 'hyderabad': [0, 5], 'jamshedpur': [6], 'odisha': [9]}

In [7]:
df8.groupby(["age","location"]).groups      # grouping multiples columns

{(20, 'hyderabad'): [0, 5], (20, 'odisha'): [9], (21, 'chennai'): [2], (22, 'bangalore'): [3], (23, 'bangalore'): [8], (25, 'delhi'): [1, 4], (26, 'jamshedpur'): [6], (27, 'chennai'): [7]}

In [14]:
# 12) how can we merge two dataframe?

df9=pd.DataFrame({"AGE":[21,20,24,25,20],"NAME":["sunil","dhoni","akshay","punit","salman"]})
df10=pd.DataFrame({"AGE_1":[21,20,24,25,20],"NAME_1":["sohail","dhoni_cool","akshay_singh","punit_malhotra","salman"]})

In [15]:
l1=[df9,df10]

In [16]:
new_dataframe=pd.concat(l1)

In [17]:
new_dataframe

    AGE    NAME  AGE_1          NAME_1
0  21.0   sunil    NaN             NaN
1  20.0   dhoni    NaN             NaN
2  24.0  akshay    NaN             NaN
3  25.0   punit    NaN             NaN
4  20.0  salman    NaN             NaN
0   NaN     NaN   21.0          sohail
1   NaN     NaN   20.0      dhoni_cool
2   NaN     NaN   24.0    akshay_singh
3   NaN     NaN   25.0  punit_malhotra
4   NaN     NaN   20.0          salman

In [28]:
new_dataframe["AGE_1"].fillna(35, inplace =True)

In [29]:
new_dataframe

    AGE    NAME  AGE_1          NAME_1
0  21.0   sunil   35.0             NaN
1  20.0   dhoni   35.0             NaN
2  24.0  akshay   35.0             NaN
3  25.0   punit   35.0             NaN
4  20.0  salman   35.0             NaN
0   NaN     NaN   21.0          sohail
1   NaN     NaN   20.0      dhoni_cool
2   NaN     NaN   24.0    akshay_singh
3   NaN     NaN   25.0  punit_malhotra
4   NaN     NaN   20.0          salman

In [31]:
new_dataframe["AGE"].fillna(35, inplace =True)
new_dataframe

    AGE    NAME  AGE_1          NAME_1
0  21.0   sunil   35.0             NaN
1  20.0   dhoni   35.0             NaN
2  24.0  akshay   35.0             NaN
3  25.0   punit   35.0             NaN
4  20.0  salman   35.0             NaN
0  35.0     NaN   21.0          sohail
1  35.0     NaN   20.0      dhoni_cool
2  35.0     NaN   24.0    akshay_singh
3  35.0     NaN   25.0  punit_malhotra
4  35.0     NaN   20.0          salman

In [33]:
new_dataframe["NAME_1"].fillna("Nothing", inplace =True)
new_dataframe

    AGE    NAME  AGE_1          NAME_1
0  21.0   sunil   35.0         NOTHING
1  20.0   dhoni   35.0         NOTHING
2  24.0  akshay   35.0         NOTHING
3  25.0   punit   35.0         NOTHING
4  20.0  salman   35.0         NOTHING
0  35.0     NaN   21.0          sohail
1  35.0     NaN   20.0      dhoni_cool
2  35.0     NaN   24.0    akshay_singh
3  35.0     NaN   25.0  punit_malhotra
4  35.0     NaN   20.0          salman

In [34]:
new_dataframe["NAME"].fillna("NOTHING", inplace =True)
new_dataframe

    AGE     NAME  AGE_1          NAME_1
0  21.0    sunil   35.0         NOTHING
1  20.0    dhoni   35.0         NOTHING
2  24.0   akshay   35.0         NOTHING
3  25.0    punit   35.0         NOTHING
4  20.0   salman   35.0         NOTHING
0  35.0  NOTHING   21.0          sohail
1  35.0  NOTHING   20.0      dhoni_cool
2  35.0  NOTHING   24.0    akshay_singh
3  35.0  NOTHING   25.0  punit_malhotra
4  35.0  NOTHING   20.0          salman

In [35]:

# 13) how to merge two dataframe using append?


df11=pd.DataFrame({"AGE":[21,20,24,25,20],"NAME":["sunil","dhoni","akshay","punit","salman"]})
df12=pd.DataFrame({"AGE_1":[21,20,24,25,20],"NAME_1":["sohail","dhoni_cool","akshay_singh","punit_malhotra","salman"]})

In [36]:
l2=[df11,df12]

In [38]:
new_data=df11.append(df12)

In [39]:
new_data

    AGE    NAME  AGE_1          NAME_1
0  21.0   sunil    NaN             NaN
1  20.0   dhoni    NaN             NaN
2  24.0  akshay    NaN             NaN
3  25.0   punit    NaN             NaN
4  20.0  salman    NaN             NaN
0   NaN     NaN   21.0          sohail
1   NaN     NaN   20.0      dhoni_cool
2   NaN     NaN   24.0    akshay_singh
3   NaN     NaN   25.0  punit_malhotra
4   NaN     NaN   20.0          salman

In [42]:
new_data["NAME"].fillna("let me search", inplace =True)

new_data["NAME_1"].fillna("still searching", inplace =True)

new_data["AGE_1"].fillna("28", inplace =True)
new_data["AGE"].fillna("25", inplace =True)
new_data

  AGE           NAME AGE_1           NAME_1
0  21          sunil    28  still searching
1  20          dhoni    28  still searching
2  24         akshay    28  still searching
3  25          punit    28  still searching
4  20         salman    28  still searching
0  25  let me search    21           sohail
1  25  let me search    20       dhoni_cool
2  25  let me search    24     akshay_singh
3  25  let me search    25   punit_malhotra
4  25  let me search    20           salman

In [43]:
# 14) how to merge two dataframe with names?
df13=pd.DataFrame({"AGE":[21,20,24,25,20],"NAME":["sunil","dhoni","akshay","punit","salman"]})
df14=pd.DataFrame({"AGE_1":[21,20,24,25,20],"NAME_1":["sohail","dhoni_cool","akshay_singh","punit_malhotra","salman"]})

In [44]:
l4=[df13,df14]
df15=pd.concat(l4,keys=["df13","df14"])

In [45]:
df15

         AGE    NAME  AGE_1          NAME_1
df13 0  21.0   sunil    NaN             NaN
     1  20.0   dhoni    NaN             NaN
     2  24.0  akshay    NaN             NaN
     3  25.0   punit    NaN             NaN
     4  20.0  salman    NaN             NaN
df14 0   NaN     NaN   21.0          sohail
     1   NaN     NaN   20.0      dhoni_cool
     2   NaN     NaN   24.0    akshay_singh
     3   NaN     NaN   25.0  punit_malhotra
     4   NaN     NaN   20.0          salman

In [47]:
# 15) how to merge a dataframe with pandas series?
df16=pd.DataFrame({"AGE":[21,20,24,25,20],"NAME":["sunil","dhoni","akshay","punit","salman"]})
df17=pd.Series([21000,24000,51000,26000,17000],name="salary")

In [48]:
df17

0    21000
1    24000
2    51000
3    26000
4    17000
Name: salary, dtype: int64

In [50]:
new_dataframe_1=pd.concat([df16,df17])
new_dataframe_1

    AGE    NAME        0
0  21.0   sunil      NaN
1  20.0   dhoni      NaN
2  24.0  akshay      NaN
3  25.0   punit      NaN
4  20.0  salman      NaN
0   NaN     NaN  21000.0
1   NaN     NaN  24000.0
2   NaN     NaN  51000.0
3   NaN     NaN  26000.0
4   NaN     NaN  17000.0

In [51]:
new_dataframe_1=pd.concat([df16,df17],axis=1)       # axis = 1 means columns wise
new_dataframe_1

   AGE    NAME  salary
0   21   sunil   21000
1   20   dhoni   24000
2   24  akshay   51000
3   25   punit   26000
4   20  salman   17000

In [52]:
new_dataframe_1=pd.concat([df16,df17],axis=0)        # by feault its in row wise that is axis =0
new_dataframe_1

    AGE    NAME        0
0  21.0   sunil      NaN
1  20.0   dhoni      NaN
2  24.0  akshay      NaN
3  25.0   punit      NaN
4  20.0  salman      NaN
0   NaN     NaN  21000.0
1   NaN     NaN  24000.0
2   NaN     NaN  51000.0
3   NaN     NaN  26000.0
4   NaN     NaN  17000.0

In [62]:
# 16) how to merge two dataframe based on columns?


df19=pd.DataFrame({"AGE":[21,20,24,25,20],"NAME":["sunil","dhoni","akshay","punit","salman"]})
df20=pd.DataFrame({"AGE":[21,20,24,25,20],"NAME":["sunil","dhoni","akshay_singh","punit","salman"]})   ## column name should be same on both the dataframe

In [63]:
new_df=pd.merge(df19,df20,on="NAME")
new_df

   AGE_x    NAME  AGE_y
0     21   sunil     21
1     20   dhoni     20
2     25   punit     25
3     20  salman     20

In [64]:
new_df2=pd.merge(df19,df20,on=["NAME","AGE"])
new_df2

   AGE    NAME
0   21   sunil
1   20   dhoni
2   25   punit
3   20  salman

In [69]:
#17)How to merge two dataframe based on joins?

#a)left outer join
#b)right outer join
#c)full outer join
#d)inner join

df22=pd.DataFrame({"id":[1,2,3,4,5],"name":["amit","zeeshan","salman","sunil","mahesh"]})

df23=pd.DataFrame({"id":[5,6,7,8],"name":["ram","shyam","sita","gita"]})

In [70]:
new_df=pd.merge(df22,df23,how='left',on='id')

In [71]:
new_df

   id   name_x name_y
0   1     amit    NaN
1   2  zeeshan    NaN
2   3   salman    NaN
3   4    sunil    NaN
4   5   mahesh    ram

In [72]:
new_df=pd.merge(df22,df23,how='right',on='id')
new_df

   id  name_x name_y
0   5  mahesh    ram
1   6     NaN  shyam
2   7     NaN   sita
3   8     NaN   gita

In [73]:
new_df=pd.merge(df22,df23,how='inner',on='id')
new_df

   id  name_x name_y
0   5  mahesh    ram

In [75]:
new_df=pd.merge(df22,df23,how='outer')
new_df

   id     name
0   1     amit
1   2  zeeshan
2   3   salman
3   4    sunil
4   5   mahesh
5   5      ram
6   6    shyam
7   7     sita
8   8     gita